AIRService/Connected Services/WebService.VNA.WSPassengerDetailsRQ/PassengerDetails3.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:sws="https://webservices.sabre.com/websvc" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:pd="http://services.sabre.com/sp/pd/v3_4" targetNamespace="https://webservices.sabre.com/websvc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="PassengerDetails3.4.0RQRS.xsd" namespace="http://services.sabre.com/sp/pd/v3_4" />
      <xsd:import schemaLocation="built-ins/msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="built-ins/wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="PassengerDetailsInput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="pd:PassengerDetailsRQ" />
  </wsdl:message>
  <wsdl:message name="PassengerDetailsOutput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="pd:PassengerDetailsRS" />
  </wsdl:message>
  <wsdl:portType name="PassengerDetailsPortType">
    <wsdl:operation name="PassengerDetailsRQ">
      <wsdl:input message="sws:PassengerDetailsInput" />
      <wsdl:output message="sws:PassengerDetailsOutput" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="PassengerDetailsSoapBinding" type="sws:PassengerDetailsPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="PassengerDetailsRQ">
      <soap:operation soapAction="PassengerDetailsRQ" />
      <wsdl:input>
        <soap:header message="sws:PassengerDetailsInput" part="header" use="literal" />
        <soap:header message="sws:PassengerDetailsInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:input>
      <wsdl:output>
        <soap:header message="sws:PassengerDetailsOutput" part="header" use="literal" />
        <soap:header message="sws:PassengerDetailsOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="PassengerDetailsService">
    <wsdl:port name="PassengerDetailsPortType" binding="sws:PassengerDetailsSoapBinding">
      <soap:address location="https://webservices.havail.sabre.com/websvc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>